Repository: BravoBaldo/Translations
Catalog: FastLed/FastLED_OmegaT/tm/auto/OmegaT_ESP32-level2.tmx
Source language: en_us
Languages: it_it

source: Plug your ESP32 board and wait for the drivers to install (or install manually any that might be required)
it_it: Collegare la scheda ESP32 e attendere l'installazione dei driver (o installare manualmente quelli necessari)

source: Plus, if that Wi-Fi network has internet access, your ESP32 can also access information from the internet, like fetching weather data or sending information to a cloud service.
it_it: Inoltre, se la rete Wi-Fi ha accesso a Internet, l'ESP32 può anche accedere a informazioni da Internet, come il recupero di dati meteorologici o l'invio di informazioni a un servizio cloud.

source: Point-to-Point (1:1)
it_it: Punto-punto (1:1)

source: Point-to-Point (1:1)Broadcast (1:many)Mesh (many:many)
it_it: Punto-punto (1:1) Broadcast (1:molti) Mesh (molti:molti)

source: Power
it_it: Potenza

source: Power Consumption
it_it: Consumo Energetico

source: Power Consumption: Bluetooth Classic typically consumes more power (around 1 W), while BLE is designed for low power consumption (typically between 0.01 and 0.5 W), making it suitable for battery-powered devices that need to operate for extended periods.
it_it: Consumo Energetico: il Bluetooth Classic in genere consuma più energia (circa 1 W), mentre il BLE è progettato per un basso consumo energetico (in genere tra 0,01 e 0,5 W), rendendolo adatto a dispositivi alimentati a batteria che devono funzionare per periodi prolungati.

source: Power Management
it_it: Gestione Energetica

source: Power Pins There are two power pins: the VIN pin and the 3V3 pin.
it_it: Pin di alimentazione Ci sono due pin di alimentazione: il pin VIN e il pin 3V3.

source: Power Requirement
it_it: Requisiti di Alimentazione

source: Prepare the sketch and configuration for initial upload with a serial port - Start Arduino IDE and load sketch OTAWebUpdater.ino available under File > Examples > OTAWebUpdater.ino - Update ssid and pass in the sketch so the module can join your Wi-Fi network - Open File > Preferences, look for “Show verbose output during:” and check out “compilation” option
it_it: Preparare lo sketch e la configurazione per il caricamento iniziale tramite una porta seriale - Avviare Arduino IDE e caricare lo sketch OTAWebUpdater.ino disponibile in File > Examples > OTAWebUpdater.ino - Aggiornare l'SSID e password nello sketch in modo che il modulo possa connettersi alla rete Wi-Fi - Open File > Preferences, cercare “Show verbose output during:” e selezionare l'opzione “compilation”

source: Press enter, and you should see your visitor counter web page pop up, just like in the previous example.
it_it: Premere invio e si dovrebbe vedere apparire la pagina web del contatore dei visitatori, proprio come nell'esempio precedente.

source: Press the Upload button in the Arduino IDE to upload a new sketch.
it_it: Premere il pulsante "Upload" nell'IDE di Arduino per caricare un nuovo sketch.

source: Pretty straightforward, right?
it_it: Abbastanza semplice, vero?

source: Price
it_it: Prezzo

source: Price: Which Board Offers the Most Value?
it_it: Prezzo: Quale Scheda Offre il Miglior Rapporto Qualità-prezzo?

source: Processing Power and Memory
it_it: Potenza di Elaborazione e Memoria

source: Processing the web page Placeholders
it_it: Elaborazione dei Segnaposto della pagina web

source: Processor
it_it: Processore

source: Programming and Community Support
it_it: Programmazione e Supporto della Community

source: Project Overview
it_it: Panoramica del Progetto

source: Protocols
it_it: Protocolli

source: Pulse Counter
it_it: Contatore di Impulsi

source: RTC Memory
it_it: Memoria RTC

source: Range: Both BLE and Classic can cover up to 100 meters, but the exact distance varies depending on the environment and implementation.
it_it: Portata: Sia il BLE che il Classic possono coprire fino a 100 metri, ma la distanza esatta varia a seconda dell'ambiente e dell'implementazione.

source: Reading WebSocket Messages and Broadcasting
it_it: Lettura e Trasmissione di Messaggi WebSocket

source: Ready?
it_it: Pronti?

source: Reason
it_it: Motivo

source: Red LED - Power Indicator
it_it: LED rosso - Indicatore di alimentazione

source: Release the BOOT button when the Writing at 0x00001000... (100%) message appears in the Arduino IDE log after Connecting....
it_it: Rilasciare il pulsante BOOT quando nel log dell'IDE Arduino dopo "Connecting...." compare il messaggio "Writing at 0x00001000... (100%)".

source: Remember!
it_it: Da ricordare!

source: Remote control peripheral, with 2 transmit channels and 2 receive channels
it_it: Periferica di controllo remoto, con 2 canali di trasmissione e 2 canali di ricezione

source: Requirements
it_it: Requisiti

source: Resources
it_it: Risorse

source: Restart Arduino IDE.
it_it: Riavviare l'IDE Arduino.

source: Restricted Usage GPIO's
it_it: GPIO con utilizzo limitato

source: Rich set of Peripherals
it_it: Ricco set di Periferiche

source: Right after that, we send the web page back to the browser using server.send() , and, as before, we build that page using a custom function called createHTML() .
it_it: Subito dopo, inviamo la pagina web al browser tramite server.send() e, come in precedenza, creiamo la pagina utilizzando una funzione personalizzata chiamata createHTML() .

source: Right after that, we use WiFi.softAPConfig() to set up the IP address, gateway, and subnet mask for this new network.
it_it: Subito dopo, utilizziamo WiFi.softAPConfig() per impostare l'indirizzo IP, il gateway e la subnet mask per questa nuova rete.

source: Robust Design
it_it: Design Robusto

source: Run the command:
it_it: Eseguire il comando:

source: Rx pin, used for flashing and debugging
it_it: Pin Rx, utilizzato per il flashing e il debug

source: SD card
it_it: Scheda SD

source: SDIO/SPI slave controller
it_it: Controller slave SDIO/SPI

source: SPI Interface
it_it: Interfaccia SPI

source: SPI Pins ESP32 has three SPIs (SPI, HSPI, and VSPI) in slave and master modes.
it_it: Pin SPI L'ESP32 dispone di tre SPI (SPI, HSPI e VSPI) in modalità slave e master.

source: SPI, I2C & I2S interface
it_it: Interfaccia SPI, I2C e I2S

source: SPI, I2C & I2S interface - Three SPI and one I2C interfaces for connecting various sensors and peripherals, as well as two I2S interfaces for adding sound to your project.
it_it: Interfaccia SPI, I2C e I2S - Tre interfacce SPI e una I2C per il collegamento di vari sensori e periferiche, oltre a due interfacce I2S per aggiungere audio al progetto.

source: SPI, I2C and I2S interface
it_it: Interfacce SPI, I2C e I2S

source: Safe to use?
it_it: Sicuro da usare?

source: Second, we create a DallasTemperature object and pass it the reference to the OneWire object we just created.
it_it: In secondo luogo, creiamo un oggetto DallasTemperature e gli passiamo il riferimento all'oggetto OneWire appena creato.

source: See `Boards <boards/boards.html>`_ for more details about ESP32 development boards.
it_it: Vedere `Board <boards/boards.html>`_ per ulteriori dettagli sulle schede di sviluppo ESP32.

source: See `ESP32-C3`_
it_it: Vedere `ESP32-C3`_

source: See `ESP32`_
it_it: Vedere `ESP32`_

source: See `Installing Guides <installing.html>`_ for more details on how to install the Arduino ESP32 support.
it_it: Consultare le `Guide di installazione <installing.html>`_ per maggiori dettagli su come installare il supporto Arduino ESP32.

source: Select ``Clone Existing Repository``
it_it: Selezionare ``Clone Existing Repository``

source: Select source and destination
it_it: Selezionare sorgente e destinazione

source: Select the COM port that the board is attached to
it_it: Selezionare la porta COM a cui è collegata la scheda

source: Select your board in ``Tools > Board`` menu
it_it: Selezionare la scheda nel menù ``Tools > Board``

source: Sensors
it_it: Sensori

source: Serial Communication
it_it: Comunicazione Seriale

source: Services
it_it: Servizi

source: Setting Up the Arduino IDE
it_it: Configurazione dell'IDE Arduino

source: Setting the Web Page Heading
it_it: Impostazione dell'Intestazione della Pagina Web

source: Shared Function
it_it: Funzione Condivisa

source: Similarly, we have rules for turning LED1 off ( /led1off ), turning LED2 on ( /led2on ), and turning LED2 off ( /led2off ).
it_it: Allo stesso modo, abbiamo regole per spegnere il LED1 ( /led1off ), accendere il LED2 ( /led2on ) e spegnere il LED2 ( /led2off ).

source: Similarly, we have separate functions for turning each LED on and off: handle_led1on() , handle_led1off() , handle_led2on() , and handle_led2off() .
it_it: Allo stesso modo, abbiamo funzioni separate per accendere e spegnere ciascun LED: handle_led1on() , handle_led1off() , handle_led2on() e handle_led2off() .

source: Simply navigate to Tools > Board > Boards Manager, search for ESP32, and verify the version you have installed.
it_it: Basta andare su "Tools > Board > Boards Manager", cercare "ESP32" e verificare la versione installata.

source: Simply put, WebSocket is a technology that allows both the client and the server to establish a connection through which either side can send messages to the other at any time.
it_it: In parole povere, WebSocket è una tecnologia che consente sia al client che al server di stabilire una connessione attraverso la quale entrambe le parti possono inviare messaggi all'altra in qualsiasi momento.

source: Since we only have one sensor connected, we use 0 to refer to it.
it_it: Dato che abbiamo un solo sensore collegato, usiamo 0 per riferirci ad esso.

source: Since we’re making the ESP32 connect to your existing Wi-Fi, we define two variables to hold your network name (SSID) and password.
it_it: Poiché stiamo facendo in modo che l'ESP32 si connetta alla rete Wi-Fi esistente, definiamo due variabili per contenere il nome della rete (SSID) e la password.

source: Sketchbook Directory: Usually ``C:/Users/[YOUR_USER_NAME]/Documents/Arduino`` and is listed underneath the "Sketchbook location" in Arduino preferences.
it_it: Directory Sketchbook: Solitamente ``C:/Users/[YOUR_USER_NAME]/Documents/Arduino`` ed è elencata sotto la voce "Sketchbook location" nelle preferenze di Arduino.

source: Small sized 2.4 GHz Wi-Fi (802.11b/g/n) and Bluetooth® 5 module
it_it: Modulo Wi-Fi a 2,4 GHz (802.11b/g/n) e Bluetooth® 5 di piccole dimensioni

source: So it should not be done unless your project involves data broadcasting (where you want to transmit the same data to multiple clients at the same time); otherwise, polling might be sufficient.
it_it: Quindi non dovrebbe essere eseguita a meno che il progetto non preveda la trasmissione di dati (quando si desidera trasmettere gli stessi dati a più client contemporaneamente); in caso contrario, il polling potrebbe essere sufficiente.

source: So just as the server is listening for new messages, all connected clients are also actively listening.
it_it: Quindi, proprio come il server è in ascolto per nuovi messaggi, anche tutti i client connessi sono in ascolto attivo.

source: So let’s get to know them better.
it_it: Conosciamoli meglio.

source: So that the WebSocket will listen for connections on the path: ws://[esp ip]/ws
it_it: In modo che il WebSocket ascolti le connessioni sul path: ws://[esp ip]/ws

source: So you could control your ESP32 project by opening a web browser on your phone or computer.
it_it: In questo modo, si potrebbe controllare il proprio progetto ESP32 aprendo un browser web sul telefono o sul computer.

source: So, ESP32 squeaks out a victory and lays claim to the king of the Wi-Fi-enabled MCU world crown.
it_it: E così, ESP32 ottiene una vittoria schiacciante e rivendica il titolo di re del mondo MCU con Wi-Fi.

source: So, WebSocket is fantastic, but that doesn’t mean it should be used everywhere.
it_it: Quindi, WebSocket è fantastico, ma ciò non significa che debba essere utilizzato ovunque.

source: So, any data received from the Bluetooth device is forwarded to your Serial Monitor.
it_it: Quindi, tutti i dati ricevuti dal dispositivo Bluetooth vengono inoltrati al Monitor Seriale.

source: So, any data you send from your computer via the serial port is forwarded to the connected Bluetooth device.
it_it: Quindi, tutti i dati inviati dal computer tramite la porta seriale vengono inoltrati al dispositivo Bluetooth connesso.

source: So, if you want to see the latest temperature, all you have to do is refresh your web page in your browser.
it_it: Quindi, per vedere la temperatura più recente, non si deve far altro che aggiornare la pagina web nel browser.

source: So, in terms of programming support and community resources, there is little to no competition between the two boards; both provide an extensive range of supported languages and resources.
it_it: Quindi, in termini di supporto alla programmazione e risorse della community, c'è poca o nessuna concorrenza tra le due schede; entrambe offrono un'ampia gamma di linguaggi e risorse supportati.

source: So, it turns on the LED and then sends back a new webpage showing that the first LED is now on.
it_it: Quindi, accende il LED e invia una nuova pagina web che mostra che il primo LED è ora acceso.

source: So, just like before, when you visit the main page (represented by / ), the ESP32 will run a function called handle_OnConnect() .
it_it: Quindi, proprio come prima, quando si visita la pagina principale (rappresentata da / ), l'ESP32 eseguirà una funzione chiamata handle_OnConnect() .

source: So, let’s go the rounds with ESP32 vs. ESP8266.
it_it: Quindi, confrontiamo ESP32 ed ESP8266.

source: Some ESP32 boards enter flashing mode automatically, and the code is uploaded successfully, while others do not, and you may receive the “A fatal error occurred: Failed to connect to ESP32...
it_it: Alcune schede ESP32 entrano automaticamente in modalità flashing e il codice viene caricato correttamente, mentre altre no e si potrebbe ricevere l'errore: "Failed to connect to ESP32..."

source: Some GPIOs are routed to the RTC low-power subsystem and are referred to as RTC GPIOs.
it_it: Alcuni GPIO vengono indirizzati al sottosistema RTC a basso consumo e sono denominati GPIO RTC.

source: Some development boards require the installation of an additional core; therefore, Arduino developed the Boards Manager as a tool to add cores to the Arduino IDE.
it_it: Alcune schede di sviluppo richiedono l'installazione di un core aggiuntivo; pertanto, Arduino ha sviluppato Boards Manager come strumento per aggiungere core all'IDE di Arduino.

source: Some of the GPIO's are used for the external flash and PSRAM. These GPIO's cannot be used:
it_it: Alcuni GPIO sono utilizzati per la flash esterna e la PSRAM. Questi GPIO non possono essere utilizzati:

source: Some of the GPIO's have important features during the booting process.
it_it: Alcuni dei GPIO hanno funzioni importanti durante il processo di boot.

source: Some of these pins can be used to build a programmable gain amplifier for measuring small analog signals.
it_it: Alcuni di questi pin possono essere utilizzati per realizzare un amplificatore a guadagno programmabile per la misurazione di piccoli segnali analogici.

source: Sometimes, you might turn on your phone’s “hotspot” feature.
it_it: A volte, si potrebbe attivare la funzione “hotspot” del telefono.

source: Sounds cool?
it_it: Interessante?

source: Specifications
it_it: Specifiche

source: Stable
it_it: Stabile

source: Stable release link::
it_it: Link alla versione stabile::

source: Start Arduino IDE
it_it: Avviare Arduino IDE

source: Start Arduino and open the Preferences window.
it_it: Avviare Arduino e aprire la finestra Preferences.

source: Start ``Git GUI`` and do the following steps:
it_it: Avviare ``Git GUI`` e procedi nel modo seguente:

source: Start ``Git GUI`` and you should see the repository under ``Open Recent Repository``.
it_it: Avviare ``Git GUI`` e si dovrebbe vedere il repository sotto ``Open Recent Repository``.

source: Starting with the Arduino IDE version 1.6.4, Arduino allows installation of third-party platform packages using Boards Manager.
it_it: A partire dalla versione 1.6.4 dell'IDE Arduino, Arduino consente l'installazione di pacchetti di piattaforme di terze parti tramite Boards Manager.

source: Station (STA) Mode
it_it: Modalità Station (STA)

source: Step 1: Installing or Updating the Arduino IDE
it_it: Fase 1: Installazione o aggiornamento dell'IDE di Arduino

source: Step 2: Installing the USB-to-Serial Bridge Driver
it_it: Fase 2: Installazione del driver del bridge USB-seriale

source: Step 3: Installing the ESP32 Arduino Core
it_it: Fase 3: Installazione del core ESP32 Arduino

source: Step 4: Selecting the Board and Port
it_it: Fase 4: Selezione della scheda e della porta

source: Step 5: Testing the Installation
it_it: Fase 5: Test dell'installazione

source: Steps to install Arduino ESP32 support on Windows:
it_it: Passaggi per installare il supporto per Arduino ESP32 su Windows:

source: Strapping Pins
it_it: Pin di strapping

source: Styling the Web Page
it_it: Definizione dello stile della pagina web

source: Support
it_it: Supporto

source: Supported IDEs
it_it: IDE Supportate

source: Supported Operating Systems
it_it: Sistemi Operativi Supportati

source: Supported SoC's
it_it: SoC supportati

source: Supported Topologies
it_it: Topologie Supportate

source: Switches & Indicators
it_it: Switch & Indicatori

source: TX/RX, up to 8 channels
it_it: TX/RX, fino a 8 canali

source: Take a look at the table below that compares BLE and Bluetooth Classic in more detail.
it_it: Consultare la tabella seguente che confronta più dettagliatamente BLE e Bluetooth Classic.

source: Temperature Sensor
it_it: Sensore di Temperatura

source: Testing the Code
it_it: Test del Codice

source: Thanks to the ESP32’s pin multiplexing feature, which allows multiple peripherals to share a single GPIO pin.
it_it: Grazie alla funzione di multiplexing dei pin dell'ESP32, che consente a più periferiche di condividere un singolo pin GPIO.

source: That’s because every time the page refreshes, the browser requests all the resources again: the HTML, the styling (CSS), any JavaScript code, and even images.
it_it: Questo perché ogni volta che la pagina si aggiorna, il browser richiede nuovamente tutte le risorse: HTML, stile (CSS), codice JavaScript e persino le immagini.

source: That’s exactly what we did when building a simple ESP32 web server , and it works perfectly.
it_it: È esattamente quello che abbiamo fatto quando abbiamo costruito un semplice server web ESP32 , e funziona perfettamente.

source: That’s it!
it_it: Ecco fatto!

source: That’s it.
it_it: Ecco fatto.

source: That’s okay if you only want to check the temperature once in a while.
it_it: Questo va bene se si desidera controllare la temperatura solo di tanto in tanto.

source: That’s precisely what you’ll learn in this tutorial: how to create a web server with the ESP32 using the WebSocket communication protocol.
it_it: Questo è esattamente ciò che si imparerà in questo tutorial: come creare un server web con l'ESP32 utilizzando il protocollo di comunicazione WebSocket.

source: That’s pretty much all that’s new for setting up AP mode!
it_it: Questo è praticamente tutto ciò che c'è di nuovo per la configurazione della modalità AP!

source: That’s where AP mode comes in handy.
it_it: È qui che la modalità AP torna utile.

source: That’s why each element with a placeholder has an id attribute.
it_it: Ecco perché ogni elemento con un segnaposto ha un attributo id .

source: The 1-Wire communication protocol used by the DS18B20 sensor is a bit complex, and writing all the code for it from scratch would take a lot of time.
it_it: Il protocollo di comunicazione 1-Wire utilizzato dal sensore DS18B20 è un po' complesso e scrivere tutto il codice da zero richiederebbe molto tempo.

source: The 3V3 pin is the output from the on-board voltage regulator; you can get up to 600 mA from it.
it_it: Il pin 3V3 è l'uscita del regolatore di tensione integrato; è possibile ottenere fino a 600 mA da esso.

source: The 3V3 pin is the output from the on-board voltage regulator; you can get up to 600mA from it.
it_it: Il pin 3V3 è l'uscita del regolatore di tensione integrato; da esso è possibile ottenere fino a 600 mA.

source: The %STATE% placeholder will be replaced with either “ON” or “OFF” based on the LED’s current state.
it_it: Il segnaposto %STATE% verrà sostituito con "ON" o "OFF" in base allo stato corrente del LED.

source: The %STATE% placeholder will be replaced with the appropriate text (either “ON” or “OFF”) based on the LED’s current status.
it_it: Il segnaposto %STATE% verrà sostituito con il testo appropriato ("ON" o "OFF") in base allo stato corrente del LED.

source: The cleanupClients() method iterates through all the connected WebSocket clients and removes those that are no longer active or connected.
it_it: Il metodo cleanupClients() scorre tutti i client WebSocket connessi e rimuove quelli che non sono più attivi o connessi.

source: The createHTML() function in this example is quite a bit different from our previous ones.
it_it: La funzione createHTML() in questo esempio è piuttosto diversa dalle precedenti.

source: The eventHandler() function simply checks the type argument to determine the type of event that has occurred and responds to that event.
it_it: La funzione eventHandler() controlla semplicemente l'argomento type per determinare il tipo di evento che si è verificato e risponde a tale evento.

source: The handle_OnConnect() function is the one that gets called every time someone visits the main page of our web server.
it_it: La funzione handle_OnConnect() è quella che viene chiamata ogni volta che qualcuno visita la pagina principale del nostro server web.

source: The handle_OnConnect() function runs whenever you visit the main page of our web server (i.e., the ESP32’s IP address).
it_it: La funzione handle_OnConnect() viene eseguita ogni volta che si visita la pagina principale del server web (ovvero l'indirizzo IP dell'ESP32).

source: The index_html constant is then defined.
it_it: Viene quindi definita la costante index_html .

source: The textAll() method of the AsyncWebSocket class allows the ESP32 to send the same message to all connected clients at the same time, ensuring that the LED’s state remains synchronized across all clients.
it_it: Il metodo textAll() della classe AsyncWebSocket consente all'ESP32 di inviare lo stesso messaggio a tutti i client connessi contemporaneamente, garantendo che lo stato del LED rimanga sincronizzato su tutti i client.

source: The deviceIndex is a number that tells the ESP32 which sensor we want to read from the 1-Wire bus.
it_it: deviceIndex è un numero che indica all'ESP32 quale sensore vogliamo leggere dal bus 1-Wire.

source: The id attribute gives each element a unique identifier.
it_it: L'attributo id assegna a ciascun elemento un identificatore univoco.

source: The eventHandler() function contains logic to determine what type of WebSocket event has occurred (like a new client connection, data received, client disconnected, etc.) and how to respond to that event.
it_it: La funzione eventHandler() contiene la logica per determinare quale tipo di evento WebSocket si è verificato (ad esempio, una nuova connessione client, dati ricevuti, client disconnesso, ecc.) e come rispondere a tale evento.

source: The processor() function is responsible for searching for such placeholders within the HTML text and replacing them with the appropriate values before sending the web page to the browser.
it_it: La funzione processor() è responsabile della ricerca di tali segnaposto all'interno del testo HTML e della loro sostituzione con i valori appropriati prima di inviare la pagina web al browser.
